{"config": [{"config": {"trainable": true, "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "function_type": "lambda", "output_shape_type": "raw", "name": "lambda_1", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000`_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa1/home/ubuntu/notebook/train_data/Project/model.py\u00da\b<lambda>\u001a\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape": [160, 320, 3]}, "class_name": "Lambda"}, {"config": {"name": "cropping2d_1", "trainable": true, "cropping": [[70, 25], [0, 0]]}, "class_name": "Cropping2D"}, {"config": {"subsample": [4, 4], "trainable": true, "nb_filter": 24, "b_constraint": null, "border_mode": "same", "W_regularizer": null, "name": "convolution2d_1", "activity_regularizer": null, "bias": true, "nb_row": 5, "activation": "linear", "W_constraint": null, "nb_col": 5, "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"subsample": [2, 2], "trainable": true, "nb_filter": 36, "b_constraint": null, "border_mode": "same", "W_regularizer": null, "name": "convolution2d_2", "activity_regularizer": null, "bias": true, "nb_row": 5, "activation": "linear", "W_constraint": null, "nb_col": 5, "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"subsample": [2, 2], "trainable": true, "nb_filter": 48, "b_constraint": null, "border_mode": "same", "W_regularizer": null, "name": "convolution2d_3", "activity_regularizer": null, "bias": true, "nb_row": 5, "activation": "linear", "W_constraint": null, "nb_col": 5, "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"subsample": [2, 2], "trainable": true, "nb_filter": 64, "b_constraint": null, "border_mode": "same", "W_regularizer": null, "name": "convolution2d_4", "activity_regularizer": null, "bias": true, "nb_row": 3, "activation": "linear", "W_constraint": null, "nb_col": 3, "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"subsample": [2, 2], "trainable": true, "nb_filter": 64, "b_constraint": null, "border_mode": "same", "W_regularizer": null, "name": "convolution2d_5", "activity_regularizer": null, "bias": true, "nb_row": 3, "activation": "linear", "W_constraint": null, "nb_col": 3, "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "input_dim": 640, "b_constraint": null, "activation": "linear", "W_regularizer": null, "name": "dense_1", "activity_regularizer": null, "bias": true, "output_dim": 1164, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_6", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "input_dim": 1164, "b_constraint": null, "activation": "linear", "W_regularizer": null, "name": "dense_2", "activity_regularizer": null, "bias": true, "output_dim": 100, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_7", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "input_dim": 100, "b_constraint": null, "activation": "linear", "W_regularizer": null, "name": "dense_3", "activity_regularizer": null, "bias": true, "output_dim": 50, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_8", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "input_dim": 50, "b_constraint": null, "activation": "linear", "W_regularizer": null, "name": "dense_4", "activity_regularizer": null, "bias": true, "output_dim": 10, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_5", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_9", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "input_dim": 10, "b_constraint": null, "activation": "linear", "W_regularizer": null, "name": "dense_5", "activity_regularizer": null, "bias": true, "output_dim": 1, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}