{"config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 160, 320, 3], "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000`_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa4/home/ubuntu/notebook/train_data/ProjectObj/model.py\u00da\b<lambda> \u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "trainable": true, "output_shape": [160, 160, 3], "name": "lambda_1", "input_dtype": "float32", "function_type": "lambda"}}, {"class_name": "Lambda", "config": {"arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000s,\u0000\u0000\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0002\u0000\u0085\u0002\u0000d\u0003\u0000d\u0004\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000f\u0004\u0000\u0019S)\u0005N\u00e9A\u0000\u0000\u0000\u00e9\u008c\u0000\u0000\u0000\u00e9\u0000\u0000\u0000\u0000i@\u0001\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0004\u0000\u0000\u0000r\u0004\u0000\u0000\u0000\u00fa4/home/ubuntu/notebook/train_data/ProjectObj/model.py\u00da\b<lambda>#\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "trainable": true, "output_shape": [75, 320, 3], "name": "lambda_2", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_row": 7, "name": "convolution2d_1", "nb_col": 7, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "subsample": [2, 2], "activity_regularizer": null, "bias": true, "trainable": true, "nb_filter": 64, "b_constraint": null, "activation": "relu", "border_mode": "same"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "name": "zeropadding2d_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [3, 3], "trainable": true, "name": "maxpooling2d_1", "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_row": 1, "name": "convolution2d_2", "nb_col": 1, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "subsample": [2, 2], "activity_regularizer": null, "bias": true, "trainable": true, "nb_filter": 64, "b_constraint": null, "activation": "relu", "border_mode": "same"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_row": 3, "name": "convolution2d_3", "nb_col": 3, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "subsample": [2, 2], "activity_regularizer": null, "bias": true, "trainable": true, "nb_filter": 192, "b_constraint": null, "activation": "relu", "border_mode": "same"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "name": "zeropadding2d_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [3, 3], "trainable": true, "name": "maxpooling2d_2", "strides": [1, 2], "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "AveragePooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "name": "averagepooling2d_1", "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 1500, "name": "dense_1", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "activation": "linear", "input_dim": 1920}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 500, "name": "dense_2", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "activation": "linear", "input_dim": 1500}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.2, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 1, "name": "dense_3", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "activation": "linear", "input_dim": 500}}], "class_name": "Sequential", "keras_version": "1.2.1"}