{"config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000`_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa1/home/ubuntu/notebook/train_data/Project/model.py\u00da\b<lambda>\u001a\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "function_type": "lambda", "name": "lambda_1", "input_dtype": "float32", "output_shape": [160, 320, 3], "trainable": true, "batch_input_shape": [null, 160, 320, 3], "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"name": "cropping2d_1", "trainable": true, "cropping": [[69, 25], [0, 0]]}, "class_name": "Cropping2D"}, {"config": {"b_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 24, "bias": true, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "activation": "relu", "nb_col": 5, "b_regularizer": null, "nb_row": 5, "subsample": [1, 1], "name": "convolution2d_1", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_1", "trainable": true, "padding": [0, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"strides": [2, 4], "dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [3, 3], "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 36, "bias": true, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "activation": "linear", "nb_col": 5, "b_regularizer": null, "nb_row": 5, "subsample": [1, 1], "name": "convolution2d_2", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_2", "trainable": true, "padding": [0, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"strides": [1, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "pool_size": [3, 3], "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 48, "bias": true, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "activation": "linear", "nb_col": 5, "b_regularizer": null, "nb_row": 5, "subsample": [1, 1], "name": "convolution2d_3", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_3", "trainable": true, "padding": [0, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3", "pool_size": [3, 3], "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "bias": true, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "activation": "linear", "nb_col": 3, "b_regularizer": null, "nb_row": 3, "subsample": [2, 2], "name": "convolution2d_4", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 128, "bias": true, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "activation": "linear", "nb_col": 4, "b_regularizer": null, "nb_row": 2, "subsample": [2, 2], "name": "convolution2d_5", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "activation": "linear", "b_constraint": null, "output_dim": 384, "input_dim": 768, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "activation": "linear", "b_constraint": null, "output_dim": 96, "input_dim": 384, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "activation": "linear", "b_constraint": null, "output_dim": 50, "input_dim": 96, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "activation": "linear", "b_constraint": null, "output_dim": 10, "input_dim": 50, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_4", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_5", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "elu_9", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "activation": "linear", "b_constraint": null, "output_dim": 1, "input_dim": 10, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_5", "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}