{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "trainable": true, "batch_input_shape": [null, 160, 320, 3], "arguments": {}, "output_shape": [160, 320, 3], "function_type": "lambda", "input_dtype": "float32", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000`_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa1/home/ubuntu/notebook/train_data/Project/model.py\u00da\b<lambda>\u001a\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Cropping2D", "config": {"cropping": [[70, 25], [0, 0]], "trainable": true, "name": "cropping2d_1"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "border_mode": "same", "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_1", "trainable": true, "W_constraint": null, "nb_filter": 24, "nb_row": 5, "dim_ordering": "tf", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "subsample": [4, 4]}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "border_mode": "same", "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_2", "trainable": true, "W_constraint": null, "nb_filter": 36, "nb_row": 5, "dim_ordering": "tf", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "border_mode": "same", "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_3", "trainable": true, "W_constraint": null, "nb_filter": 48, "nb_row": 5, "dim_ordering": "tf", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "border_mode": "same", "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_4", "trainable": true, "W_constraint": null, "nb_filter": 64, "nb_row": 3, "dim_ordering": "tf", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "border_mode": "same", "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_5", "trainable": true, "W_constraint": null, "nb_filter": 64, "nb_row": 3, "dim_ordering": "tf", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "subsample": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Dense", "config": {"input_dim": 640, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_1", "b_regularizer": null, "output_dim": 1164, "b_constraint": null, "activity_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"class_name": "Dense", "config": {"input_dim": 1164, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_2", "b_regularizer": null, "output_dim": 100, "b_constraint": null, "activity_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_3"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}}, {"class_name": "Dense", "config": {"input_dim": 100, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_3", "b_regularizer": null, "output_dim": 50, "b_constraint": null, "activity_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}}, {"class_name": "Dense", "config": {"input_dim": 50, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_4", "b_regularizer": null, "output_dim": 10, "b_constraint": null, "activity_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_5"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_9"}}, {"class_name": "Dense", "config": {"input_dim": 10, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_5", "b_regularizer": null, "output_dim": 1, "b_constraint": null, "activity_regularizer": null, "bias": true}}]}